HCHCHC99/WS/T_v.4.36.15_20260428/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
    /* CH1(PB6) - 低有效 */
    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH1, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH1, ENABLE);

    /* CH2(PB7) - 低有效 */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);

    /* CH3(PB8) - 低有效 */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);

    /* CH4(PB9) - 低有效 */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}

// ========== 新增：使用PWM驱动设置运行时的占空比（全部低有效） ==========
static void Motor_SetRunDutyDirect(uint16_t ch1, uint16_t ch2, uint16_t ch3, uint16_t ch4) {
    // 直接操作寄存器设置占空比（绕过PWM驱动的缓启动）
    uint32_t u32Period = TMRA_GetPeriodValue(CM_TMRA_4);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH1, (u32Period * ch1) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH2, (u32Period * ch2) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH3, (u32Period * ch3) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH4, (u32Period * ch4) / 100U);
}

// ========== 修改：切换极性前先将占空比归零 ==========
static void Motor_RampForward(uint16_t target_duty) {
    uint16_t limited_duty = Motor_LimitDuty(target_duty);
    uint16_t duty_low = limited_duty;
    uint16_t duty_high = 100 - limited_duty;
    
    // 获取当前占空比
    uint16_t current_duty_ch1 = PWM_GetDuty(&g_motor_pwm_ch1);
    
    MAIN_D("[MOTOR] Ramp FWD: current=%d%%, target CH1/2=%d%%, CH3/4=%d%%, time=%dms\r\n",
           current_duty_ch1, duty_low, duty_high, MOTOR_RAMP_TIME_MS);
    
    // 如果不是从停止状态启动，或者当前占空比不是0，先快速归零
    if (current_duty_ch1 != 0) {
        // 快速将占空比降到 0（50ms 快速归零）
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 100 - current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 100 - current_duty_ch1, 0, 50);
        
        // 等待归零完成
        tickTimer_DelayMs(50);
        current_duty_ch1 = 0;
        MAIN_D("[MOTOR] Ramp FWD: zeroed duty before polarity switch\r\n");
    }
    
    // 切换极性（此时占空比为0，不会冲击）
    Motor_SetRunPolarity();
    
    // 从 0% 缓启动到目标值
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, duty_high, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, duty_high, MOTOR_RAMP_TIME_MS);
}

static void Motor_RampReverse(uint16_t target_duty) {
    uint16_t limited_duty = Motor_LimitDuty(target_duty);
    uint16_t duty_low = 100 - limited_duty;
    uint16_t duty_high = limited_duty;
    
    // 获取当前占空比
    uint16_t current_duty_ch1 = PWM_GetDuty(&g_motor_pwm_ch1);
    
    MAIN_D("[MOTOR] Ramp REV: current=%d%%, target CH1/2=%d%%, time=%dms\r\n",
           current_duty_ch1, duty_low, MOTOR_RAMP_TIME_MS);
    
    // 如果不是从停止状态启动，或者当前占空比不是0，先快速归零
    if (current_duty_ch1 != 0) {
        // 快速将占空比降到 0（50ms 快速归零）
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 100 - current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 100 - current_duty_ch1, 0, 50);
        
        // 等待归零完成（简单延时，或轮询状态）
        tickTimer_DelayMs(50);
        current_duty_ch1 = 0;
    }
    
    // 切换极性（此时占空比为0，不会冲击）
    Motor_SetRunPolarity();
    
    // 从 0% 缓启动到目标值
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, duty_high, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, duty_high, MOTOR_RAMP_TIME_MS);
}

// ========== 新增：立即设置正转（无缓启动） ==========
static void Motor_RunForwardImmediate(uint16_t duty) {
    uint16_t limited_duty = Motor_LimitDuty(duty);
    uint16_t duty_low = limited_duty;
    uint16_t duty_high = 100 - limited_duty;
    
    // 先设置运行极性
    Motor_SetRunPolarity();
    
    // 立即设置占空比
    Motor_SetRunDutyDirect(duty_low, duty_low, duty_high, duty_high);
    
    // 同时更新PWM驱动的当前占空比（保持同步）
    PWM_SetDuty(&g_motor_pwm_ch1, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch2, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch3, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch4, duty_high);
    
    MAIN_D("[MOTOR] Immediate FWD: duty=%d%%, CH1/2=%d%%, CH3/4=%d%%\r\n",
           limited_duty, duty_low, duty_high);
}

// ========== 新增：立即设置反转（无缓启动） ==========
static void Motor_RunReverseImmediate(uint16_t duty) {
    uint16_t limited_duty = Motor_LimitDuty(duty);
    uint16_t duty_low = 100 - limited_duty;
    uint16_t duty_high = limited_duty;
    
    // 先设置运行极性
    Motor_SetRunPolarity();
    
    // 立即设置占空比
    Motor_SetRunDutyDirect(duty_low, duty_low, duty_high, duty_high);
    
    // 同时更新PWM驱动的当前占空比（保持同步）
    PWM_SetDuty(&g_motor_pwm_ch1, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch2, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch3, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch4, duty_high);
    
    MAIN_D("[MOTOR] Immediate REV: duty=%d%%, CH1/2=%d%%, CH3/4=%d%%\r\n",
           limited_duty, duty_low, duty_high);
}

// ========== 电机仲裁结果回调函数（弱定义，用户可重写） ==========
//    GPIO_SET(PHU_PORT, PHU_PIN);
//    GPIO_SET(PHV_PORT, PHV_PIN);

__weak void Motor_OnArbitrationStop(MotorDevice_t* motor) {
    (void)motor;

    TMR4_PWM_CommutationStop();
    s_eLastArbitrationDir = DIR_NONE;
    s_u16LastTargetDuty = 0;
    motor_state = 0;

    MAIN_D("[MOTOR_ARB] Stop: TMR4 commutation stopped
");
}


    // GPIO_SET(PHU_PORT, PHU_PIN);
    // GPIO_RESET(PHV_PORT, PHV_PIN);
 
__weak void Motor_OnArbitrationFwd(MotorDevice_t* motor, float duty) {
    (void)motor;
    uint16_t duty_percent = (uint16_t)(duty);
    if (duty_percent < 2) duty_percent = 2;
    if (duty_percent > 98) duty_percent = 98;

